Test Chat Product/chat-app/app/channels/chat_channel.rb

    def create(ops)
        ChatMessage.create(
            content: ops.fetch('content')
        )
---
INSERT INTO "chat_messages" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "test"], ["created_at", "2019-02-22 06:28:50.115283"], ["updated_at", "2019-02-22 06:28:50.115283"]]