app/controllers/api/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms"
---
    def index
        if params[:user_id] == "all"
            @chatrooms = Chatroom.all.includes(:users, :messages);

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages"."id" FROM "messages" WHERE "messages"."chatroom_id" = $1  [["chatroom_id", 1]]
SELECT "users"."id" FROM "users" INNER JOIN "chatroom_subscriptions" ON "users"."id" = "chatroom_subscriptions"."user_id" WHERE "chatroom_subscriptions"."chatroom_id" = $1  [["chatroom_id", 1]]
---
    def show
        @chatroom = Chatroom.includes(:users, :messages).find_by(id: params[:id])