app/controllers/api/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = $1  [["chatroom_id", 1]]
---
    def index
        @messages = Message.where(chatroom_id: params[:chatroom_id])

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @message = Message.find_by(id: params[:id])