app/channels/messages_channel.rb

INSERT INTO "messages" ("body", "chatroom_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "fdsfsdafd"], ["chatroom_id", 1], ["author_id", 1], ["created_at", "2019-02-28 19:31:55.550625"], ["updated_at", "2019-02-28 19:31:55.550625"]]
---
  def create(payload)
    Message.create(
      body: payload.fetch('body'),
      author_id: payload.fetch('author_id'),
      chatroom_id: payload.fetch('chatroom_id'),
      parent_id: payload.fetch('parent_id')
    )