app/views/api/chatrooms/show.json.jbuilder

SELECT "users"."id" FROM "users" INNER JOIN "chatroom_subscriptions" ON "users"."id" = "chatroom_subscriptions"."user_id" WHERE "chatroom_subscriptions"."chatroom_id" = $1  [["chatroom_id", 1]]
SELECT "messages"."id" FROM "messages" WHERE "messages"."chatroom_id" = $1  [["chatroom_id", 1]]
---
json.extract! @chatroom, :id, :title, :topic, :chatroom_type, :admin_id
json.user_ids @chatroom.users.ids
json.message_ids @chatroom.messages.ids